Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_StartAngleIdent_F16.c
/* Generate compare values to output necessary pulses */
static inline void Ifx_MDA_StartAngleIdent_F16_generateCompares(uint8_t phase, uint16_t pattern1, uint16_t pattern2,
                                                                uint16_t* compareValues_tick);

/* Estimate rotor position and assign outputs, after all the averaging cycles are completed */
static inline void Ifx_MDA_StartAngleIdent_F16_estimatePosition(Ifx_MDA_StartAngleIdent_F16* self);

/* Assign compare values to the module outputs */
static inline void Ifx_MDA_StartAngleIdent_F16_assignOutputs(Ifx_MDA_StartAngleIdent_F16* self,
                                                             uint16_t                   * compareValues_tick);

/* Set compare values in active short */
static inline void Ifx_MDA_StartAngleIdent_F16_setActiveShort(Ifx_MDA_StartAngleIdent_F16* self, uint16_t
                                                              compareValue_tick);

/* Resets the temporary values used for the position estimation */
static inline void Ifx_MDA_StartAngleIdent_F16_resetData(Ifx_MDA_StartAngleIdent_F16* self);

/* Function to get the component ID */
void Ifx_MDA_StartAngleIdent_F16_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MDA_StartAngleIdent_F16_componentID;
}


/* Function to get the component version */
void Ifx_MDA_StartAngleIdent_F16_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MDA_StartAngleIdent_F16_componentVersion;
}


void Ifx_MDA_StartAngleIdent_F16_init(Ifx_MDA_StartAngleIdent_F16* self)
{
    /* Initialize state control variables */
    self->p_clearFault = false;
    self->p_enable     = false;

    /* Initialize status variable */
    self->p_status.state              = Ifx_MDA_StartAngleIdent_F16_State_init;
    self->p_status.voltageFluctuation = false;

    /* Initialize internal variables */
    self->p_faultCheckingActive = false;

    /* Reset data used for the estimation */
    Ifx_MDA_StartAngleIdent_F16_resetData(self);

    /* Set active short low */
    Ifx_MDA_StartAngleIdent_F16_setActiveShort(self, IFX_MDA_STARTANGLEIDENT_F16_ZERO_DUTY_CYCLE);

    /* Assign trigger initial values */
    /* First trigger is located at the first quarter of the period */
    self->p_output.triggerTime_tick[0] = IFX_MDA_STARTANGLEIDENT_F16_ZERO_DUTY_CYCLE / 4;

    /* Second trigger is as late as possible to measure the maximum difference */
    self->p_output.triggerTime_tick[1] = IFX_MDA_STARTANGLEIDENT_F16_ZERO_DUTY_CYCLE -
                                         (IFX_MDA_STARTANGLEIDENT_F16_CFG_DEADTIME_TICK +
                                          IFX_MDA_STARTANGLEIDENT_F16_CFG_RINGINGTIME_TICK +
                                          IFX_MDA_STARTANGLEIDENT_F16_CFG_DRIVERDELAY_TICK);

    /* Reset outputs */
    self->p_output.estimatedAngle = 0U;
    self->p_output.maxAdmittance  = 0;
}


void Ifx_MDA_StartAngleIdent_F16_execute(Ifx_MDA_StartAngleIdent_F16* self, Ifx_Math_Fract16 dcLinkVoltageQ15,
                                         Ifx_Math_Fract16* shuntCurrentsQ15)
{
    /* Store clearFault variable at the beginning of the module */
    bool                              clearFault = self->p_clearFault;

    /* Variable to store the state */
    Ifx_MDA_StartAngleIdent_F16_State previousState = self->p_status.state;
    Ifx_MDA_StartAngleIdent_F16_State nextState     = previousState;

    /* Check if any fault occurred */
    bool                              faultStatus = Ifx_MDA_StartAngleIdent_F16_checkFaultStatus(self,
        dcLinkVoltageQ15, IFX_MDA_STARTANGLEIDENT_F16_CFG_FAULT_REACTION_VOLTAGE_FLUCTUATION, clearFault);

    switch (previousState)
    {
        /* Initialize the module */
        case Ifx_MDA_StartAngleIdent_F16_State_init:

            /* Set the state to off */
            nextState = Ifx_MDA_StartAngleIdent_F16_State_off;
            break;

        /* Start angle identification not running */
        case Ifx_MDA_StartAngleIdent_F16_State_off:
            nextState = Ifx_MDA_StartAngleIdent_F16_stateOff(self);
            break;

        /* Start angle identification is generating pulses */
        case Ifx_MDA_StartAngleIdent_F16_State_on:
            nextState = Ifx_MDA_StartAngleIdent_F16_stateOn(self, dcLinkVoltageQ15, shuntCurrentsQ15, faultStatus);
            break;

        /* Start angle identification is in fault */
        case Ifx_MDA_StartAngleIdent_F16_State_fault:
            nextState = Ifx_MDA_StartAngleIdent_F16_stateFault(self, faultStatus, clearFault);
            break;

        /* Start angle identification is ready */
        case Ifx_MDA_StartAngleIdent_F16_State_estimationReady:

            if (self->p_enable == false)
            {
                nextState = Ifx_MDA_StartAngleIdent_F16_State_off;
            }
            else
            {
                nextState = Ifx_MDA_StartAngleIdent_F16_State_estimationReady;
            }

            break;

        /* Default transition to init */
        default:
            nextState = Ifx_MDA_StartAngleIdent_F16_State_init;
            break;
    }

    self->p_status.state = nextState;

    /* Clear the internal variable */
    if (clearFault == true)
    {
        self->p_clearFault = false;
    }
}


static inline bool Ifx_MDA_StartAngleIdent_F16_checkFaultStatus(Ifx_MDA_StartAngleIdent_F16* self, Ifx_Math_Fract16
                                                                dcLinkVoltageQ15, uint8_t faultReaction, bool
                                                                clearFault)
{
    /* Variable to store the voltage fluctuation fault status */
    bool faultVoltageFluctuation;
    bool faultStatus = false;

    /* Clear flag if fault clear is true */
    if (clearFault == true)
    {
        faultVoltageFluctuation     = false;
        self->p_faultCheckingActive = false;
    }
    else
    {
        faultVoltageFluctuation = self->p_status.voltageFluctuation;
    }

    /* 1 Check if this fault is configured as ENABLED */
    if (faultReaction >= IFX_MDA_STARTANGLEIDENT_F16_FAULT_REACTION_ENABLE)
    {
        /* Calculate the voltage tolerance based on last voltage measurement */
        Ifx_Math_Fract16 voltageTolerance = Ifx_Math_Mul_F16(self->p_previousDcLinkVoltageQ15,
            IFX_MDA_STARTANGLEIDENT_F16_CFG_VOLTAGE_FLUCTUATION_RANGE_Q15);

        /* Calculate voltage difference between previous measurement and current measurement */
        Ifx_Math_Fract16 voltageDifference = Ifx_Math_Sub_F16(self->p_previousDcLinkVoltageQ15, dcLinkVoltageQ15);

